{"pages":[{"title":"IObit Unlocker","text":"Never Worry about \"Cannot Delete Files\" on Your PC Better Unlock Stubborn Files IObit Unlocker performs well in solving \"cannot delete files\", \"access is denied\", \"The file is in use by another program or user\", or \"There has been a sharing violation\" problems. With IObit Unlocker, you can manage all your files the way you want. Not Only Unlock files With \"Unlock & Delete\", \"Unlock & Rename\", \"Unlock & Move\", and \"Unlock & Copy\", IObit Unlocker offers easier ways to unlock and manage the files and folders to keep them safe and available.","tags":"Others","url":"iobit-unlocker.html"},{"title":"LockHunter","text":"LockHunter is a foolproof file unlocker It is a free tool to delete files blocked by something you do not know. LockHunter is useful for fighting against malware, and other programs that are blocking files without a reason. Unlike other similar tools it deletes files into the recycle bin so you may restore them if deleted by mistake. Key Features Shows processes locking a file or folder Gives you detailed information on the process Allows to unlock, delete, copy or rename a locked file Can delete a file at next OS restart Allows to kill locking process Allows to remove locking processes from hard drive Can unload DLLs from processes Integrates in to Explorer menu It deletes files into the recycle bin, so you may restore them if deleted by mistake Supports both 32 and 64 bit Windows","tags":"Others","url":"lockhunter.html"},{"title":"Files","text":"Files is the modern file manager you always wanted. It's packed with features such as fluent design, tabs, layout modes, and much more. We are collaborating with users every step of the way through GitHub, if you have a feature request or feedback for the app, make sure to share it on the GitHub repository https://github.com/files-community/Files.","tags":"Others","url":"files.html"},{"title":"HWMonitor","text":"HWMonitor is a hardware monitoring program that reads PC systems main health sensors : voltages, temperatures, fans speed. The program handles the most common sensor chips, like ITE® IT87 series, most Winbond® ICs, and others. In addition, it can read modern CPUs on-die core thermal sensors, as well has hard drives temperature via S.M.A.R.T, and video card GPU temperature.","tags":"Sys info","url":"hwmonitor.html"},{"title":"Geany","text":"Geany - The Flyweight IDE Geany is a powerful, stable and lightweight programmer's text editor that provides tons of useful features without bogging down your workflow. It runs on Linux, Windows and MacOS is translated into over 40 languages, and has built-in support for more than 50 programming languages.","tags":"Text Editors","url":"geany.html"},{"title":"Chrome Remote Desktop","text":"Your desktop anywhere Securely access your computer from your phone, tablet, or another computer. It's fast, simple, and free. I was a fan of teamviewer but they pissed me with their constant pushesh to upgrade to their paid version which has monthly fees so I changed to this and I am very happy with it. Features Unatended access - with clippord shareing and anything you need. Get support - To let someone else access this computer, generate a one-time access code and share it with them. Give support - To connect to and access a remote computer, enter the one-time access code from the user.","tags":"Network","url":"chrome-remote-desktop.html"},{"title":"Process Explorer","text":"Ever wondered which program has a particular file or directory open? Now you can find out. Process Explorer shows you information about which handles and DLLs processes have opened or loaded. The Process Explorer display consists of two sub-windows. The top window always shows a list of the currently active processes, including the names of their owning accounts, whereas the information displayed in the bottom window depends on the mode that Process Explorer is in: if it is in handle mode you'll see the handles that the process selected in the top window has opened; if Process Explorer is in DLL mode you'll see the DLLs and memory-mapped files that the process has loaded. Process Explorer also has a powerful search capability that will quickly show you which processes have particular handles opened or DLLs loaded. The unique capabilities of Process Explorer make it useful for tracking down DLL-version problems or handle leaks, and provide insight into the way Windows and applications work.","tags":"Sys info","url":"process-explorer.html"},{"title":"TeraCopy","text":"I fouund this software when I have to copy big files from a remote NAS, the connection was dropping from time to time and windows explorer was just stoping without any option to resume. This software is very small and stable, its freemium but the free features are more than enought and there are no ads or prompts to upgrade. Be in control In case of a copy error TeraCopy will try to recover. If unable to recover in the worst case scenario it will simply skip the problematic file, not terminating the entire transfer. It can also wait for network or device reconnection. Unnecessary files can be skipped to reduce the transfer time. During the process, TeraCopy shows detected errors, and allows you to fix the problem by recopying only the problematic files. Features Pause and resume file transfers. Pause copy process at any time to free up system resources and continue with a single click. Error recovery. In case of copy error, TeraCopy will try several times and in the worse case just skips the file, not terminating the entire transfer. File verification TeraCopy can verify files after they have been copied to ensure that they are identical. This is done by comparing hashes of source and target files. Supported algorithms: CRC32, MD5, SHA-1, SHA-256, SHA-512, Panama, Tiger, RipeMD, Whirlpool and xxHash. Confirm drag'n'drop TeraCopy can optionally show a confirmation dialog on every drag and drop operation. It can prevent you from moving folders accidentally from one location to another. Shell integration TeraCopy can completely replace the Explorer copy and move functions, enabling you to work with files as usual. Preserve date timestamps TeraCopy keeps the original time and date of files when copying.","tags":"Network","url":"teracopy.html"},{"title":"HTTP Downloader","text":"HTTP Downloader is a download manager for the HTTP(S) and FTP(S) protocols. Maximize your download throughput by utilizing high performance input/output completion ports (IOCP). HTTP Downloader can open thousands of connections at a time and consumes very little system resources. HTTP Downloader is a high-performance, multi-part download manager. You can Start, Pause, Stop, and Queue up to 100 downloads at a time. Each download can be split into 100 parts. That's 10,000 connections! Drag and drop links into the program's main window or, select File > Add URL(s)... to bring up the Add URL(s) window. From here you can select the download location to save the files. The Advanced button allows you to configure the number of parts to split each download, the SSL / TSL version to use for HTTPS connections, authentication information (basic or digest), and any necessary cookies, headers, and POST data. Clicking the Download button will begin the download(s).","tags":"Network","url":"http-downloader.html"},{"title":"Krita","text":"Krita Desktop is a free and open source painting application. Krita is the full-featured free digital painting studio for artists who want to create professional work from start to end. Krita is used by comic book artists, illustrators, concept artists, matte and texture painters and in the digital VFX industry. Krita has been in development for over 10 years and has had an explosion in growth recently. It offers many common and innovative features to help the amateur and professional alike. Krita has a user-friendly interface. The dockers and panels can be moved and customized for your specific workflow. Once you have your setup, you can save it as your own workspace. You can also create your own shortcuts for commonly used tools. In addition to painting, Krita comes with vector, filter, group, and file layers. Combine, order, and flatten layers to help your artwork stay organized. There are also three different views on how to see the layers.","tags":"Multimedia","url":"krita.html"},{"title":"UNetbootin","text":"UNetbootin allows you to create bootable Live USB drives for Ubuntu and other Linux distributions without burning a CD. You can either let UNetbootin download one of the many distributions supported out-of-the-box for you, or supply your own Linux .iso file. Supported Distributions UNetbootin has built-in support for automatically downloading and loading the following distributions, though installing other distributions is also supported: Ubuntu, Kubuntu, Xubuntu, Lubuntu, Debian, openSUSE, Arch Linux, Damn Small Linux, SliTaz, Linux Mint, Zenwalk, Slax, Elive, CentOS, FreeBSD, NetBSD, 3CX, Fedora, PCLinuxOS, Sabayon Linux, Gentoo, MEPIS, LinuxConsole, Frugalware Linux, xPUD, Puppy Linux, UNetbootin can also be used to load various system utilities, including: Parted Magic, SystemRescueCD, Super Grub Disk, Dr.Web Antivirus, F-Secure Rescue CD, Kaspersky Rescue Disk, Backtrack, Ophcrack, NTPasswd, Gujin, Smart Boot Manager, FreeDOS","tags":"Others","url":"unetbootin.html"},{"title":"WhatsApp","text":"Features TEXTS - Simple, Reliable Messaging. Message your friends and family for free*. WhatsApp uses your phone's Internet connection to send messages so you can avoid SMS fees. GROUP CHAT - Groups to keep in touch. Keep in touch with the groups of people that matter the most, like your family or coworkers. With group chats, you can share messages, photos, and videos with up to 256 people at once. You can also name your group, mute or customize notifications, and more. WHATSAPP VOICE AND VIDEO CALLS - Speak Freely. With voice calls, you can talk to your friends and family for free , even if they're in another country. And with free video calls, you can have face-to-face conversations for when voice or text just isn't enough. WhatsApp voice and video calls use your phone's Internet connection, instead of your cell plan's voice minutes, so you don't have to worry about expensive calling charges. WHATSAPP ON WEB AND DESKTOP - Keep the Conversation Going. With WhatsApp on the web and desktop, you can seamlessly sync all of your chats to your computer so that you can chat on whatever device is most convenient for you. Download the desktop app or visit web.whatsapp.com to get started. END-TO-END ENCRYPTION - Security by Default. Some of your most personal moments are shared on WhatsApp, which is why we built end-to-end encryption into the latest versions of our app. When end-to-end encrypted, your messages and calls are secured so only you and the person you're communicating with can read or listen to them, and nobody in between, not even WhatsApp. PHOTOS AND VIDEOS - Share Moments that Matter. Send photos and videos on WhatsApp instantly. You can even capture the moments that matter to you most with a built-in camera. With WhatsApp, photos and videos send quickly even if you're on a slow connection. DOCUMENTS - Document Sharing Made Easy. Send PDFs, documents, spreadsheets, slideshows and more, without the hassle of email or file sharing apps. You can send documents up to 100 MB, so it's easy to get what you need over to who you want. VOICE MESSAGES - Say What's On Your Mind. Sometimes, your voice says it all. With just one tap you can record a Voice Message, perfect for a quick hello or a longer story.","tags":"Chat","url":"whatsapp.html"},{"title":"Greenshot","text":"Greenshot is a light-weight screenshot software tool for Windows with the following key features: Quickly create screenshots of a selected region, window or fullscreen; you can even capture complete (scrolling) web pages from Internet Explorer. Easily annotate, highlight or obfuscate parts of the screenshot. Export the screenshot in various ways: save to file, send to printer, copy to clipboard, attach to e-mail, send Office programs or upload to photo sites like Flickr or Picasa, and others. ...and a lot more options simplyfying creation of and work with screenshots every day. Being easy to understand and configurable, Greenshot is an efficient tool for project managers, software developers, technical writers, testers and anyone else creating screenshots.","tags":"Multimedia","url":"greenshot.html"},{"title":"IP Camera Viewer","text":"IP Camera Viewer keeps eye on your home, office, parking area, or anywhere you have an IP camera. View video from multiple cameras simultaneously. More than 1800 different IP camera models are supported including Axis, Canon, Cisco, D-Link, Foscam, Linksys, Mobotix, Panasonic, Pixord, Sony, Toshiba, and Vivotek. Virtually all USB cameras work with IP Camera Viewer. IP Camera Viewer allows you to individually configure video properties such as the resolution and frame rate for each camera. You can also set image properties such as saturation, brightness, and contrast for USB and IP Cameras. Arrange multiple IP cameras in the preview layout you want. What if your camera is mounted upside-down or its preview is tilted a bit? With IP Camera Viewer you can adjust the orientation of your camera preview. You can also ad just the coverage area with support for PTZ (Pan, Tilt, and Zoom) enabled network cameras. IP Camera Viewer lets you digitally zoom on an image, even if your camera doesn't support zoom. IP Camera Viewer is free and ideal for both personal and business purposes.","tags":"IP Cams","url":"ip-camera-viewer.html"},{"title":"Chrome","text":"Google Chrome is a free web browser developed by Google, used for accessing web pages on the internet. As of April 2019, it's the most popular web browser of choice worldwide, holding 60% of the web browser market share. Google Chrome is also a cross-platform browser, meaning that there are versions that work on different computers, mobile devices, and different operating systems. According to Statista, Google Chrome for Android is the most used version, holding nearly 31% of the global web browser market share as of February 2019.","tags":"Browsers","url":"chrome.html"},{"title":"Firefox","text":"By default, Firefox sports a clean and simple interface that isn't much different from other major browsers, such as Google Chrome. The tabs, address/search bar and bookmark bar are layered on top, and there's a space for navigation controls on the left. That said, unlike Chrome, Firefox comes with a lot of customization options for the interface. Every element of the basic UI can be moved around, and several buttons can be added anywhere you like with a simple drag-and-drop process.","tags":"Browsers","url":"firefox.html"},{"title":"AutoHotkey","text":"Powerful. Easy to learn. The ultimate automation scripting language for Windows. AutoHotkey is a free, open-source scripting language for Windows that allows users to easily create small to complex scripts for all kinds of tasks such as: form fillers, auto-clicking, macros, etc. Define hotkeys for the mouse and keyboard, remap keys or buttons and autocorrect-like replacements. Creating simple hotkeys has never been easier; you can do it in just a few lines or less! AutoHotkey gives you the freedom to automate any desktop task. It's small, fast and runs out-of-the-box. Best of all, it's free, open-source (GNU GPLv2), and beginner-friendly. Why not give it a try?","tags":"Others","url":"autohotkey.html"},{"title":"VirtualBox","text":"VirtualBox is a powerful x86 and AMD64/Intel64 virtualization product for enterprise as well as home use. Not only is VirtualBox an extremely feature rich, high performance product for enterprise customers, it is also the only professional solution that is freely available as Open Source Software under the terms of the GNU General Public License (GPL) version 2. See \"About VirtualBox\" for an introduction. Presently, VirtualBox runs on Windows, Linux, Macintosh, and Solaris hosts and supports a large number of guest operating systems including but not limited to Windows (NT 4.0, 2000, XP, Server 2003, Vista, Windows 7, Windows 8, Windows 10), DOS/Windows 3.x, Linux (2.4, 2.6, 3.x and 4.x), Solaris and OpenSolaris, OS/2, and OpenBSD. VirtualBox is being actively developed with frequent releases and has an ever growing list of features, supported guest operating systems and platforms it runs on. VirtualBox is a community effort backed by a dedicated company: everyone is encouraged to contribute while Oracle ensures the product always meets professional quality criteria.","tags":"Others","url":"virtualbox.html"},{"title":"Atom","text":"Atom is a hackable text editor for the 21st century, built on Electron, and based on everything we love about our favorite editors. We designed it to be deeply customizable, but still approachable using the default configuration.","tags":"Text Editors","url":"atom.html"},{"title":"Avidemux","text":"Avidemux is a free video editor designed for simple cutting, filtering and encoding tasks. It supports many file types, including AVI, DVD compatible MPEG files, MP4 and ASF, using a variety of codecs. Tasks can be automated using projects, job queue and powerful scripting capabilities. Avidemux is available for Linux, BSD, Mac OS X and Microsoft Windows under the GNU GPL license. The program was written from scratch by Mean, but code from other people and projects has been used as well. Patches, translations and even bug reports are always welcome.","tags":"Multimedia","url":"avidemux.html"},{"title":"Brave","text":"Experience unparalleled privacy and security. Brave fights malware and prevents tracking, keeping your information safe and secure. It's our top priority. Brave Browser Feature List Shields Ad blocking Fingerprinting prevention Cookie control HTTPS upgrading Block scripts Per-site shield settings Configurable global shield defaults Tabs & Windows Private Windows Pinned Tabs Auto-unload Drag and drop Duplicate Close Options Find on page Print page Address Bar Add Bookmark Autosuggest URLs Search from address bar Autosuggest search terms Show/hide bookmarks toolbar* Show secure or insecure site Security Clear browsing data Built-in password manager Form autofill Control content access to full-screen presentation* Control site access to autoplay media Send \"Do not track\" with browsing requests Search Choose default search engine Use keyboard shortcuts for alternate search engines Option to use DuckDuckGo for private window search Extensions/Plugins Brave Desktop now supports most of the Chrome extensions in the chrome web store","tags":"Browsers","url":"brave.html"},{"title":"Shotcut","text":"Shotcut the best free video editing software is available on Windows, Mac, and Linux. Shotcut is a fully open source program. This means after downloading it, you get access to all the features without the need for a paid upgrade. This video editor supports a wide range of video formats and boasts a great collection of tutorial videos. While this video editing software has great features, some users may find the interface a little quirky. This software was originally designed for Linux and it definitely shows. But, under the hood, it's still a quality video editor. Two of the most striking features are 4K HD resolution support and its timeline editing. Not many free versions of the software include 4K resolution support. Shotcut also doesn't require you to import your video into the editor: this can be a time saver if you are dealing with large video files.","tags":"Multimedia","url":"shotcut.html"},{"title":"MPC-HC","text":"MPC-HC is an extremely light-weight, open source media player for Windows®. It supports all common video and audio file formats available for playback. It is 100% spyware free, there are no advertisements or toolbars. Features: Lightweight - Watch movies on any SSE2 CPU, even on your old computer back from 2000. Customizable - With its wide array of options, MPC-HC can be customized to fit almost any needs. Among other things, we added custom toolbars. All around player - MPC-HC can also be used as DVB player.","tags":"Multimedia","url":"mpc-hc.html"},{"title":"VLC media player","text":"VLC is a free and open source cross-platform multimedia player and framework that plays most multimedia files as well as DVDs, Audio CDs, VCDs, and various streaming protocols. Simple, fast and powerful Plays everything - Files, Discs, Webcams, Devices and Streams. Plays most codecs with no codec packs needed - MPEG-2, MPEG-4, H.264, MKV, WebM, WMV, MP3... Runs on all platforms - Windows, Linux, Mac OS X, Unix, iOS, Android ... Completely Free - no spyware, no ads and no user tracking.","tags":"Multimedia","url":"vlc-media-player.html"},{"title":"Tor Browser","text":"The Tor software protects you by bouncing your communications around a distributed network of relays run by volunteers all around the world: it prevents somebody watching your Internet connection from learning what sites you visit, it prevents the sites you visit from learning your physical location, and it lets you access sites which are blocked. Tor Browser lets you use Tor on Microsoft Windows, Apple MacOS, or GNU/Linux without needing to install any software. It can run off a USB flash drive, comes with a pre-configured web browser to protect your anonymity, and is self-contained (portable).","tags":"Browsers","url":"tor-browser.html"},{"title":"Visual Studio Code","text":"Visual Studio Code is a Microsoft branded source code editor under Microsoft Software License based on an open-source and free source code editor Microsoft vscode developed by Microsoft for Windows, Linux and macOS. It includes support for debugging, embedded Git control, syntax highlighting, intelligent code completion, snippets, and code refactoring. It is also customizable, so users can change the editor's theme, keyboard shortcuts, and preferences.","tags":"Text Editors","url":"visual-studio-code.html"},{"title":"GitHub Desktop","text":"Extend your GitHub workflow beyond your browser with GitHub Desktop, completely redesigned with Electron. Get a unified cross-platform experience that's completely open source and ready to customize.","tags":"Others","url":"github-desktop.html"},{"title":"OpenVPN","text":"OpenVPN is a full featured open source SSL VPN solution that accommodates a wide range of configurations, including remote access, site to site VPNs, Wi-Fi security, and enterprise scale remote access solutions with load balancing, failover, and fine grained access controls.","tags":"Network","url":"openvpn.html"},{"title":"Page Countster","text":"Page Countster is a small, portable and freeware application designed to scan a network for printers and display the information about them including the IP address, MAC Address, Host Name, Model Name, Serial Number, Total Page Count, Color Page Count and the ink levels. Features Quickly find printers on a network Auto-detection of network address range Send Printer Information Report to Email Address. Option to save a default network configuration to Config.ini Quickly reopen report(s) via Drag-N-Drop into program window. Send a (Plain Text) test page to any network printer without needing a driver. Quick & easy way to replace serial number (on HP printers) if formatter has been changed...HP's method takes, 10min, an Uber secret code, & an act of congress. Quick & easy of changing the printer's (Ready State) Display Text to any 16 character (max) string. Granted this \"feature\" is primarily a toy that will be missused...But, I couldn't resist adding it. Can also (quickly) change/update page counts & HOST Name. Scan reports can be saved in either .csv or .tsv format for import into Excel, or reopened to rescan a given group of printers. Emailed reports are in a printable HTML table format. Portablility: requires no install or runtimes Fast: Typically scans at a rate of 20 IPs per second Small: Currently only 282KB","tags":"Sys info","url":"page-countster.html"},{"title":"DragonDisk","text":"DragonDisk is a powerful file manager for Amazon S3® and all cloud storage solutions that provide compatibility with S3 API. It allows you to organize and share your data thanks to an intuitive interface similar to Windows Explorer's. Its functions and ease of use will persuade you from the start, whether you are an amateur or a professional user. DragonDisk is freeware and cross-platform, it works on Windows, Mac OS X and Linux.","tags":"Network","url":"dragondisk.html"},{"title":"Marble","text":"Marble is a Virtual Globe and World Atlas that you can use to learn more about Earth: You can pan and zoom around and you can look up places and roads. A mouse click on a place label will provide the respective Wikipedia article.","tags":"Others","url":"marble.html"},{"title":"Opera","text":"Fast, secure, easy-to-use browser Opera is a fast and free browser with advanced bookmarking, search, and personalization options. Try the Opera browser - now with a built-in ad blocker, battery saver and free VPN.","tags":"Browsers","url":"opera.html"},{"title":"Recuva","text":"Recuva® Recover your deleted files quickly and easily. Accidentally deleted an important file? Lost files after a computer crash? No problem - Recuva recovers files from your Windows computer, recycle bin, digital camera card, or MP3 player! Superior file recovery Recuva can recover pictures, music, documents, videos, emails or any other file type you've lost. And it can recover from any rewriteable media you have: memory cards, external hard drives, USB sticks and more! Recovery from damaged disks Unlike most file recovery tools, Recuva can recover files from damaged or newly formatted drives. Greater flexibility means greater chance of recovery. Deep scan for buried files For those hard to find files, Recuva has an advanced deep scan mode that scours your drives to find any traces of files you have deleted.","tags":"Sys info","url":"recuva.html"},{"title":"SpaceSniffer","text":"SpaceSniffer is a freeware disk space analyzer for Windows that make use of the Treemap concept to view the current disk usage. Among the most notable features you'll find: Features drag and drop support intuitive structure layout (multiple views for different media) zoom elements (browser-like navigation) powerful filtering (you can filter your results based on size file name age) customizable options (geometry, colors, behavior) fast scan of your hard drive (navigation worked even when the scan didn't finish) support for NTFS Alternate Data Streams and so on. SpaceSniffer is fully portable on all modern Microsoft Windows versions (doesn't have a setup file. Therefore it doesn't mess up with your current registry - it just adds an XML configuration file). You can use the executable file on other Microsoft Windows OS; there's no need to extract the archive each time.","tags":"Sys info","url":"spacesniffer.html"},{"title":"TestDisk","text":"TestDisk - Data Recovery TestDisk is powerful free data recovery software! It was primarily designed to help recover lost partitions and/or make non-booting disks bootable again when these symptoms are caused by faulty software: certain types of viruses or human error (such as accidentally deleting a Partition Table). Partition table recovery using TestDisk is really easy. Features Fix partition table, recover deleted partition Recover FAT32 boot sector from its backup Rebuild FAT12/FAT16/FAT32 boot sector Fix FAT tables Rebuild NTFS boot sector Recover NTFS boot sector from its backup Fix MFT using MFT mirror Locate ext2/ext3/ext4 Backup SuperBlock Undelete files from FAT, exFAT, NTFS and ext2 filesystem Copy files from deleted FAT, exFAT, NTFS and ext2/ext3/ext4 partitions. TestDisk has features for both novices and experts. For those who know little or nothing about data recovery techniques, TestDisk can be used to collect detailed information about a non-booting drive which can then be sent to a tech for further analysis. Those more familiar with such procedures should find TestDisk a handy tool in performing onsite recovery.","tags":"Sys info","url":"testdisk.html"},{"title":"WinDirStat","text":"WinDirStat is a disk usage statistics viewer and cleanup tool for various versions of Microsoft Windows. On start up, it reads the whole directory tree once and then presents it in three useful views: The directory list, which resembles the tree view of the Windows Explorer but is sorted by file/subtree size, The treemap, which shows the whole contents of the directory tree straight away, The extension list, which serves as a legend and shows statistics about the file types.","tags":"Sys info","url":"windirstat.html"},{"title":"XAMPP","text":"XAMPP is the most popular PHP development environment XAMPP is a completely free, easy to install Apache distribution containing MariaDB, PHP, and Perl. The XAMPP open source package has been set up to be incredibly easy to install and to use.","tags":"Others","url":"xampp.html"},{"title":"Fre ac","text":"Fre:ac is a free audio converter and CD ripper with support for various popular formats and encoders. It currently converts between MP3, MP4/M4A, WMA, Ogg Vorbis, FLAC, AAC, WAV and Bonk formats. With fre:ac you easily rip your audio CDs to MP3 or WMA files for use with your hardware player or convert files that do not play with other audio software. You can even convert whole music libraries retaining the folder and filename structure. The integrated CD ripper supports the CDDB/freedb online CD database. It will automatically query song information and write it to ID3v2 or other title information tags.","tags":"Multimedia","url":"fre-ac.html"},{"title":"Process Hacker","text":"Process Hacker is an advanced task manager. This multi-purpose tool will assist you with debugging, malware detection and system monitoring. It includes powerful process termination, memory viewing/editing and other unique and specialized features. Process Hacker's has a simple, customizable tree view with highlighting showing you the processes running on your computer. It includes detailed system statistics with graphs. Advanced features not found in other programs, such as detaching from debuggers, viewing GDI handles, viewing heaps, injecting and unloading DLLs, and more are close at hand. Process Hacker also includes powerful process termination that bypasses rootkits. You can view, edit and control services, including those not shown by the Services console. You can also view and close network connections.","tags":"Sys info","url":"process-hacker.html"},{"title":"SSD-Z","text":"SSD-Z is an information tool for Solid State Drives and other disk devices. Using a database, it will show information about your SSD, such as the controller, processing tech, NAND type etc. Other useful information related to disk devices are also shown, such as S.M.A.R.T. status and partition layout. Features Details of the controller and processing tech of NAND chips (for known devices). Verify that TRIM is enabled for your system and SSDs. S.M.A.R.T. status and full list of all the device's available attributes. List of all partitions. Including hidden, unmapped and boot partitions. Benchmark IOPS, transfer speed and random access time (work in progress) View the raw device identify data words.","tags":"Sys info","url":"ssd-z.html"},{"title":"HWiNFO","text":"In-depth Hardware Information From a quick overview unfolding into the depth of all hardware components. Always up-to date supporting latest technologies and standards. Real-Time System Monitoring Accurate monitoring of all system components for actual status and failure prediction. Customizable interface with variety of options. Extensive Reporting Multiple types of reports, status logging and interfacing with other tools or add-ons.","tags":"Sys info","url":"hwinfo.html"},{"title":"Pidgin","text":"Pidgin is a chat program which lets you log in to accounts on multiple chat networks simultaneously. This means that you can be chatting with friends on MSN, talking to a friend on Google Talk, and sitting in a Yahoo chat room all at the same time. Pidgin runs on Windows, Linux, and other UNIX operating systems. Pidgin is compatible with the following chat networks out of the box: AIM, ICQ, Google Talk, Jabber/XMPP, MSN Messenger, Yahoo!, Bonjour, Gadu-Gadu, IRC, Novell GroupWise Messenger, Lotus Sametime, SILC, SIMPLE, MXit, and Zephyr. It can support many more with plugins. Pidgin supports many features of these chat networks, such as file transfers, away messages, buddy icons, custom smilies, and typing notifications. Numerous plugins also extend Pidgin's functionality above and beyond the standard features. Pidgin integrates with the system tray on Windows, GNOME2, KDE 3, and KDE 4.","tags":"Chat","url":"pidgin.html"},{"title":"VimAkelPad","text":"AkelPad - is an open source editor for plain text. It is designed to be a small and fast. Features Single window (SDI), multi-window (MDI) and pseudo multi-window modes (PMDI); Full support of Unicode strings on Unicode systems (NT/2000/XP/2003/Vista/Seven); Support of Unicode codepages (UTF-8, UTF-16LE, UTF-16BE, UTF-32LE, UTF-32BE); Support of any codepage installed in the system; Support of DOS/Windows, Unix and Mac newline formats; Preview file open; Correct pseudographics displaying; Column text selection; Multi-level undo; Fast search/replace text strings; Remember file codepage and caret position; Printing of a document and print preview; Support of language modules; Plugins support (syntax highlighting, folding, auto-completion, scripts execution, keyboard macros and much more).","tags":"Text Editors","url":"vimakelpad.html"},{"title":"CuteMarkEd","text":"Lightweight, free and open source Markdown editor with live HTML preview, math expressions, code and markdown syntax highlighting.","tags":"Text Editors","url":"cutemarked.html"},{"title":"Cygwin","text":"Get that Linux feeling - on Windows Cygwin is a Unix-like environment and command-line interface for Microsoft Windows. Cygwin provides native integration of Windows-based applications, data, and other system resources with applications, software tools, and data of the Unix-like environment. Thus it is possible to launch Windows applications from the Cygwin environment, as well as to use Cygwin tools and applications within the Windows operating context. Cygwin is: a large collection of GNU and Open Source tools which provide functionality similar to a Linux distribution on Windows. a DLL (cygwin1.dll) which provides substantial POSIX API functionality. Cygwin is not: a way to run native Linux apps on Windows. You must rebuild your application from source if you want it to run on Windows. a way to magically make native Windows apps aware of UNIX® functionality like signals, ptys, etc. Again, you need to build your apps from source if you want to take advantage of Cygwin functionality.","tags":"SSH Clients","url":"cygwin.html"},{"title":"KDiff3","text":"KDiff3 is a diff and merge program that - compares or merges two or three text input files or directories, - shows the differences line by line and character by character (!), - provides an automatic merge-facility and - an integrated editor for comfortable solving of merge-conflicts, - supports Unicode, UTF-8 and other codecs, autodetection via byte-order-mark \"BOM\" - supports KIO on KDE (allows accessing ftp, sftp, fish, smb etc.), - Printing of differences, - Manual alignment of lines, - Automatic merging of version control history ($Log$), - and has an intuitive graphical user interface. - Windows-Explorer integration Diff-Ext-for-KDiff3 - shell extension included in installer (originally by Sergey Zorin: see also Diff Ext) - KDE-Konqueror/Dolphin service menu plugin - Simplified integration with IBM-Rational-Clearcase for Windows","tags":"Others","url":"kdiff3.html"},{"title":"Bandizip","text":"All-In-One Free Zip Archiver Bandizip is a lightweight, fast and free All-In-One Zip Archiver. Bandizip has a very fast Zip algorithm for compression & extraction with Fast Drag and Drop, High Speed Archiving, and Multi-core compression. It handles the most popular compression formats, including Zip, 7z, Rar, and so on. Features Various Compression Formats Bandizip supports various formats including RAR(part1.rar, r01), ACE, AES, ALZ, APK, ARJ, BH, BIN, BZ, BZ2, CAB, EGG, GZ, J2J, JAR, IMG, IPA, ISZ, LHA, LZMA, PMA, TBZ, TBZ2, TGZ, TLZ, TXZ, UDF, WAR, WIM, XPI, XZ, ZPAQ, LZ and Z. Secure Standard Archive Format Files are compressed in secure standard formats including ZIP, ZIPX, EXE, TAR, TGZ, LZH, ISO, and 7Z to store data safely. High-class Encryption ZipCrypto and AES 256 encryption algorithms are supported for higher security. Split Compression and Extraction for Diverse Formats Bandizip supports split compression to certain size, such as 10MB or 700MB. Besides Windows standard split compression formats (zip, z01, z02 ...), it securely supports ALZ, EGG (alz, a01, a02,... / vol1.egg, vol2.egg,...), 7Z(7z.001, 7z.002...), and RAR (part1.rar). Association with Windows Explorer In Windows Explorer, the context menu provides 'Extract, Compress with Bandizip, Compress to 7Z, Preview, etc.' Embedded Image Viewer An image viewer is embedded so that users can view images included in archives. Support for Unicode (UTF-8) For compression or extraction, foreign-language file names are sometimes fragmented. With the 'Code Page' or 'UTF-8 Save' function, Bandizip helps to display the filename perfectly. Compact, Light, and Fast Bandizip is compact, fast, and light because it does not use heavy libraries, such as MFC.","tags":"Archivers","url":"bandizip.html"},{"title":"Audacity","text":"Features Audacity is an easy-to-use audio editor and recorder. You can use it to: Record live audio. Convert tapes and records into digital recordings or CDs. Edit Ogg Vorbis, MP3, and WAV sound files. Cut, copy, splice, and mix sounds together. Change the speed or pitch of a recording. And more! See the complete list of features .","tags":"Multimedia","url":"audacity.html"},{"title":"SmarTTY","text":"SmarTTY is a free multi-tabbed SSH client that supports copying files and directories with SCP on-the-fly and editing files in-place. One SSH session - multiple tabs Most SSH servers support up to 10 sub-sessions per connection. SmarTTY makes the best of it: no annoying multiple windows, no need to relogin, just open a new tab and go! Smart Terminal Mode Automatic completion for files, folders and recent commands Easy file navigation panel for viewing files in current directory Clickable : links in command output Easy-to-use GUI for APT and YUM package managers Transfer files and whole directories Explore remote directory structure with Windows-style GUI Download and upload single files with SCP protocol Transfer entire directories with recursive SCP Quickly send and receive directories with on-the-fly TAR Edit files in-place Select \"File->Open\" to open an editor tab for a remote file: Native Windows file editing look & feel Automatic CRLF to LF conversion Option to invoke 'sudo' to save protected files Out-of-the-box public-key auth SmarTTY can automatically configure public key authentication for selected remote computers: No need to enter your password each time Private key is securely stored in Windows key container One-click configuration of remote host Your Unix password is not stored anywhere Run graphical applications seamlessly SmarTTY comes with a pre-built XMing and VcXsrv X servers. The servers will be configured and started on-the-fly as soon as you launch a graphical application in terminal: Remote X11 apps run out-of-the-box No need to configure anything manually","tags":"SSH Clients","url":"smartty.html"},{"title":"AIMP","text":"Calling AIMP a music player would be doing it a disservice. As well as playing music, the program also acts as an audio organizer, making it easy to change MP3 tags and create playlists. Playlists are an interesting feature here because as well as curating them by hand, you can also take advantage of the smart playlist option to create something to match a mood with less effort. On top of this, the program can be used to listen to streaming internet radio stations. AIMP can function as an alarm clock, audio converter and more. Features Multi-format Playback: .CDA, .AAC, .AC3, .APE, .DTS, .FLAC, .IT, .MIDI, .MO3, .MOD, .M4A, .M4B, .MP1, .MP2, .MP3, .MPC, .MTM, .OFR, .OGG, .OPUS, .RMI, .S3M, .SPX, .TAK, .TTA, .UMX, .WAV, .WMA, .WV, .XM, .DSF, .DFF, MKA, AA3, AT3, OMA, YouTube CUE Sheets supports Output supports DirectSound / ASIO / WASAPI / WASAPI Exclusive 32-bit audio processing For the best quality! Internet radio Listen internet-radio stations in OGG / WAV / MP3 / AAC / AAC+ formats Capture stream to APE, FLAC, OGG, WAV, WV, WMA and MP3 formats Capture stream as is for MP3 / AAC / AAC+ formats Web interface for remote control","tags":"Multimedia","url":"aimp.html"},{"title":"BIOS Beep codes viewer","text":"The Beep codes viewer is a simple tool that will explain the BIOS error beep codes for all the main PC BIOS manufacturers (AMI, AWARD, Phoenix, IBM). If you've ever had a PC fail its power-on self-test then you'll know how useful this can be. Typically you'll just get some pattern of beeps – one long and three short, say – and then be left hunting for your system manual to find out what these noises could possibly mean. With the Beep codes viewer, though, it's all very different. The program is portable, so save it to a USB flash drive and you can launch it from just about any PC. Then choose your BIOS type (it may say on the boot screen, if you still get one), and click on the beep code you're hearing for a detailed description of what it's trying to tell you, and how to fix the problem.","tags":"Sys info","url":"bios-beep-codes-viewer.html"},{"title":"MusicBee","text":"MusicBee is a brilliant free music player and organizer to help you enjoy your music collection – no matter how huge and sprawling. MusicBee searches your PC for music and enables you to add tracks from iTunes or Windows Media Player. Once everything has been added to your MusicBee library, the app's intelligent tagging system makes it easy to complete missing metadata using industry-standard formats, locate album art and find lyrics, which are displayed while a song plays. MusicBee is designed to make the most of your PC's hardware, with support for high-end soundcards and 5.1 surround sound. MusicBee also supports streaming, is compatible with Last.fm and SoundCloud, and is a great choice for enjoying your favorite podcasts.","tags":"Multimedia","url":"musicbee.html"},{"title":"Notepad3","text":"Although the Windows operating system was updated significantly over the past years. However, the default Windows Notepad has not been updated in 20 years. If you need a text editor for simple programming tasks, using the vanilla Windows Notepad just does not cut it. Enter Notepad3! Furthermore, Notepad3 has the following features: code folding, bracket matching, automatic indentation, word auto-completion, convert character encoding between various formats (ASCII, UTF-8, and UTF-16), newline format conversion (between DOS (CR/LF), Unix (LF), and Macintosh (CR) formats), multiple undo or redo, bookmarks, and regular expression-based find and replace.","tags":"Text Editors","url":"notepad3.html"},{"title":"Syncplify.me Notepad!","text":"Syncplify.me Notepad! Ideal replacement for your Windows' stock Notepad Syncplify.me Notepad! is an awesome replacement for your stock Windows Notepad text editor, featuring: - Multi-tab, multi-document editing - Can edit large documents (greater than 4 GB) - Easy to use, with a great look-and-feel - Printing and WYSIWYG print preview - Ideal also for advanced users and programmers - Editor styles (both for colors and syntax highlighting)","tags":"Text Editors","url":"syncplifyme-notepad.html"},{"title":"SynWrite","text":"Editors for source-code are an essential resource for programmers, since they affect the productivity in a direct way. In this opportunity, we want to present SynWrite a practical and powerful web development environment that includes the functions of top commercial brands but in this case, it is distributed at free-cost. In addition, it is possible to extend them through the plug-ins installation, which are written in Python, and they are distributed free of charge as well. SynWrite Functions Syntax-highlighting, that simplifies the code reading. Support diverse encoding systems (ASCII, Unicode, etc.). Provide several templates to standardize the coding task. Auto-completion function which fires when it is typed the first characters of a recognized tag. Automatically it closes a typed tag, avoiding. Automatic text tab, according to the function's structure. It includes a practical color picker and previewing tool, that it is especially useful for web-page design. Search and replace function enhanced with regular expression's capabilities. Tree view for source code, which allows easy navigation across the project. Integrated file-manager and project-manager. Include a build-in FTP client, facilitating the file-upload to web-server operation.","tags":"Text Editors","url":"synwrite.html"},{"title":"Wireshark","text":"Go Deep Wireshark is the world's foremost and widely-used network protocol analyzer. It lets you see what's happening on your network at a microscopic level and is the de facto (and often de jure) standard across many commercial and non-profit enterprises, government agencies, and educational institutions. Features Deep inspection of hundreds of protocols, with more being added all the time Live capture and offline analysis Standard three-pane packet browser Multi-platform: Runs on Windows, Linux, macOS, Solaris, FreeBSD, NetBSD, and many others Captured network data can be browsed via a GUI, or via the TTY-mode TShark utility The most powerful display filters in the industry Rich VoIP analysis Read/write many different capture file formats: tcpdump (libpcap), Pcap NG, Catapult DCT2000, Cisco Secure IDS iplog, Microsoft Network Monitor, - Network General Sniffer® (compressed and uncompressed), Sniffer® Pro, and NetXray®, Network Instruments Observer, NetScreen snoop, Novell LANalyzer, RADCOM WAN/LAN Analyzer, Shomiti/Finisar Surveyor, Tektronix K12xx, Visual Networks Visual UpTime, WildPackets EtherPeek/TokenPeek/AiroPeek, and many others Capture files compressed with gzip can be decompressed on the fly Live data can be read from Ethernet, IEEE 802.11, PPP/HDLC, ATM, Bluetooth, USB, Token Ring, Frame Relay, FDDI, and others (depending on your platform) Decryption support for many protocols, including IPsec, ISAKMP, Kerberos, SNMPv3, SSL/TLS, WEP, and WPA/WPA2 Coloring rules can be applied to the packet list for quick, intuitive analysis Output can be exported to XML, PostScript®, CSV, or plain text","tags":"Network","url":"wireshark.html"},{"title":"Advanced IP Scanner","text":"Reliable and free network scanner to analyse LAN. The program shows all network devices, gives you access to shared folders, provides remote control of computers (via RDP and Radmin), and can even remotely switch computers off. It is easy to use and runs as a portable edition. It should be the first choice for every network admin.","tags":"Network","url":"advanced-ip-scanner.html"},{"title":"Classic FTP","text":"Classic FTP has been specifically designed to look and feel like a traditional ftp client while supporting the latest FTP features. Its easy to use interface makes locating and editing files on your website easy. You can also upload or download files with a single click of a button. The intuitive user interface makes uploading files to the internet easy The Synchronize tool checks local and remote folders for the most up-to-date copies of everything Easily drag and drop files in and out of Classic FTP Supports the secure FTP protocol (SSL) Compatible with all popular FTP servers Runs on both Windows and Apple Mac OS X Easy setup wizard to help you establish FTP site connections","tags":"FTP Clients","url":"classic-ftp.html"},{"title":"Core FTP LE","text":"Free FTP client software for Windows Core FTP LE is a free Windows software that includes the client FTP features you need. Features like SFTP (SSH), SSL, TLS, FTPS, IDN, browser integration, site to site transfers, FTP transfer resume, drag and drop support, file viewing & editing, firewall support, custom commands, FTP URL parsing, command line transfers, filters, and much, much more! This free, secure FTP client gives you a fast, easy, reliable way to update and maintain your website via FTP. It also provides a secure method (via SSL, TLS, FTPS, HTTPS, or SFTP) to upload / download files to and from FTP servers. Check out the list of features and you'll find almost every feature you need, all in a free ftp program. There are no popup ads, advertising or spyware and you're never asked or reminded to register.","tags":"FTP Clients","url":"core-ftp-le.html"},{"title":"Dameware Free SSH Client","text":"This free tool is a terminal emulator that lets you make multiple telnet and SSH connections from one easy-to-use console. Manage multiple sessions from one console with a tabbed interface Save favorite sessions within the Windows file system Access multiple sets of saved credentials for easy log-in to different devices Connect to computers and devices using telnet, SSH1, and SSH2 protocols Plus, it's FREE!","tags":"SSH Clients","url":"dameware-free-ssh-client.html"},{"title":"Free PC Audit","text":"Free PC Audit is a freeware system, hardware and software information tool. It extracts details of all components of the PC, shows installed software with version and product key. Free PC Audit does not require installation and can be used as a portable application. It can be run from a removable storage device such as a CD-ROM drive, USB flash drive, flash card, or floppy disk. This professional tool is designed to collect and present the maximum amount of information possible about computer's hardware and software which makes them suitable for users searching for driver updates, computer manufacturers, system integrators and technical experts as well. Compatible with: from Windows NT up to Windows 10 You can use this software to backup your Windows product ID and Key.","tags":"Sys info","url":"free-pc-audit.html"},{"title":"Google Photos Backup and Sync","text":"Back up a lifetime of photos Automatically back up photos from your Mac or PC, connected cameras and SD cards. Google Photos offers unlimited space for your photos if you allow it to resize and compress them. You can also backup your images with their original size and compression but the space they use will count against your google drive space.","tags":"Multimedia","url":"google-photos-backup-and-sync.html"},{"title":"PeaZip","text":"Free RAR TAR ZIP files utility PeaZip is free file archiver utility, based on Open Source technologies of 7-Zip, p7zip, FreeArc, PAQ, and PEA projects. Cross-platform, full-featured but user-friendly alternative to WinRar, WinZip and similar general purpose archive manager applications, open and extract 180+ archive formats: 001, 7Z, ACE(*), ARC, ARJ, BZ2, CAB, DMG, GZ, ISO, LHA, PAQ, PEA, RAR, TAR, UDF, WIM, XZ, ZIP ZIPX - view full list of supported archive file formats for archiving and for extraction. Free file archiver and encryption software PeaZip provides fast, high compression ratio multi-format archiving to 7Z, ARC, BZ2, GZ, PEA, TAR, WIM, and ZIP file archives (write supported), and works as opener / extractor tool for 180+ archive types. Read file compression and decompression benchmarks page for more information about archive creation and extraction performances compared with other popular file archivers.","tags":"Archivers","url":"peazip.html"},{"title":"Radmin VPN","text":"Free VPN for your needs Connect remote machines in one virtual network Radmin VPN is a free and easy-to-use software product to create virtual private network (VPN). The program allows users to establish a secure connection between computers over the Internet as if they were connected over a LAN. Play network games over the Internet Play your favourite LAN games with your friends over the Internet. Free Radmin VPN does not limit the number of gamers. Thanks to high speed of Radmin VPN you won't see the difference – you will play your favourite games as if you were playing in the LAN. Work remotely Thanks to the integration with Radmin remote control software, Radmin VPN allows you to securely access and work at your remote computer from anywhere, whether from home, hotel or airport. Your network resources – files, apps, and emails are just a click away wherever you go.","tags":"Network","url":"radmin-vpn.html"},{"title":"ShareX","text":"ShareX is a software that will help you to easily create screenshots and share them online by hosting them to various free sites. Screen capture, file sharing and productivity tool Capture methods Fullscreen Active window Active monitor Window menu Monitor menu Region Region (Light) Region (Transparent) Last region Custom region Screen recording Screen recording (GIF) Scrolling capture Webpage capture Text capture (OCR) Auto capture After capture tasks Show quick task menu Show \"After capture\" window Add image effects / watermark Open in image editor Copy image to clipboard Print image Save image to file Save image to file as... Save thumbnail image to file Perform actions Copy file to clipboard Copy file path to clipboard Show file in explorer Recognize text (OCR) Show \"Before upload\" window Upload image to host Delete file locally","tags":"Multimedia","url":"sharex.html"},{"title":"Slack","text":"Where Work Happens When your team needs to kick off a project, hire a new employee, deploy some code, review a sales contract, finalize next year's budget, measure an A/B test, plan your next office opening, and more, Slack has you covered.","tags":"Chat","url":"slack.html"},{"title":"Speccy","text":"Fast, lightweight, advanced system information tool for your PC. Need to find out what's inside your computer? Speccy has all the information you need!","tags":"Sys info","url":"speccy.html"},{"title":"TUGZip","text":"TUGZip is a powerful award-winning freeware archiving utility for Windows® that provides support for a wide range of compressed, encoded and disc-image files, as well as very powerful features; all through an easy to use application interface and Windows Explorer integration. Features Overview Supports ZIP, 7-ZIP, A, ACE, ARC, ARJ, BH, BZ2, CAB, CPIO, DEB, GCA, GZ, IMP, JAR, LHA (LZH), LIB, RAR, RPM, SQX, TAR, TGZ, TBZ, TAZ, YZ1 and ZOO archives. Supports BIN, C2D, IMG, ISO and NRG disc-images. Support for external plugins. Windows® shell integration, for example drag & drop, shell context menu and drop handlers. Create 7-ZIP, BH, BZ2, CAB, JAR, LHA (LZH), SQX, TAR, TGZ, YZ1 and ZIP archives. Script support which allows you to make automated backups. Basic features like: add, extract, delete, rename, run, view, checkout, install, test, comment, SFX, virus-scanning, disk-spanning and much more. Repair corrupted ZIP and SQX archives. Can extract multiple archives at once using Multi Extract. Encrypt archives using 6 different algorithms. Blowfish (128-bit), DES (56-bit), Triple DES (168-bit) and Rijndael (128-bit, 192-bit and 256-bit). Create self-extracting encrypted archives. Automatic updates using the \"Web Update\" function.","tags":"Archivers","url":"tugzip.html"},{"title":"Vim","text":"What Is Vim? Vim is a highly configurable text editor built to enable efficient text editing. It is an improved version of the vi editor distributed with most UNIX systems. Vim is often called a \"programmer's editor,\" and so useful for programming that many consider it an entire IDE. It's not just for programmers, though. Vim is perfect for all kinds of text editing, from composing email to editing configuration files. Despite what the above comic suggests, Vim can be configured to work in a very simple (Notepad-like) way, called evim or Easy Vim. What Vim Is Not? Vim isn't an editor designed to hold its users' hands. It is a tool, the use of which must be learned. Vim isn't a word processor. Although it can display text with various forms of highlighting and formatting, it isn't there to provide WYSIWYG editing of typeset documents. (It is great for editing TeX, though.)","tags":"Text Editors","url":"vim.html"},{"title":"WinMTR","text":"WinMTR – Free Network Diagnostic Tool WinMTR is a Windows application which combines the functionality of the traceroute and ping utilities in a single network diagnostic tool. Using this tool you can see where the bottleneck is, it does a traceroute then continuously pings every hop and displays statistics. This application is not updated since 2011 but its running fine under windows 10.","tags":"Network","url":"winmtr.html"},{"title":"Defraggler","text":"Defraggler® Speed up your PC with quick & easy defragmentation. Defrag entire hard drives or individual files. Works with HDD and SSD and supports NTFS and FAT32 file systems! Windows shell integration: Defraggler can replace the built-in Windows defragmentation tool and add Defraggler to context menus; handy for defragmenting individual files and folders. File relocation: Defraggler has the unique ability to move large files to the back of the disc for faster access of critical and frequently used data. Health and benchmarking: The Health tab displays disc status. Defraggler also benchmarks drive performance. Quick Optimize for SSD: Defraggler's Quick Optimize for SSD feature may be of help for older SSDs that don't support TRIM or for Windows XP systems still in service.","tags":"Others","url":"defraggler.html"},{"title":"DSpeech - Text To Speech","text":"DSpeech is a TTS (Text To Speech) program with functionality of ASR (Automatic Speech Recognition) integrated. It is able to to read aloud the written text and choose the sentences to be pronounced based upon the vocal answers of the user. It is specifically designed to quickly and directly provide the functions and improved practical usefulness that are requested by this kind of program. Features Allows you to save the output as a .WAV, .MP3 or OGG file; Allows you to quickly select different voices, even combine them, or juxtapose them in order to create dialogues between different voices; DSpeech integrates a vocal recognition system that, through a simple script language, allows you to create interactive dialogs with the user; Allows you to configure the voices in an independent way; Thanks to apposite TAGs, it allows you to dynamically change the features of the voices during the playback (speed, volume and frequency), to insert pauses, emphasize specific words, or even to spell them out; Allows you to capture and reproduce the content of the ClipBoard; DSpeech is compatible with all vocal engines (SAPI 4-5 compliant); AI dialog system.","tags":"Multimedia","url":"dspeech-text-to-speech.html"},{"title":"FastStone Image Viewer","text":"FastStone Image Viewer is a fast, stable, user-friendly image browser, converter and editor. It has a nice array of features that include image viewing, management, comparison, red-eye removal, emailing, resizing, cropping, retouching and color adjustments. Its innovative but intuitive full-screen mode provides quick access to EXIF information, thumbnail browser and major functionalities via hidden toolbars that pop up when your mouse touches one of the four edges of the screen. Other features include a high quality magnifier and a musical slideshow with 150+ transitional effects, as well as lossless JPEG transitions, drop shadow effects, image annotation, scanner support, histogram and much more. It supports all major graphic formats (BMP, JPEG, JPEG 2000, animated GIF, PNG, PCX, PSD, EPS, TIFF, WMF, ICO and TGA) and popular digital camera RAW formats (CRW, CR2, NEF, PEF, RAF, MRW, ORF, SRF, ARW, SR2, RW2 and DNG).","tags":"Multimedia","url":"faststone-image-viewer.html"},{"title":"FastStone Photo Resizer","text":"An image converter and renaming tool that intends to enable users to convert, rename, resize, crop, rotate, change color depth, add text and watermarks to images in a quick and easy batch mode.","tags":"Multimedia","url":"faststone-photo-resizer.html"},{"title":"IrfanView","text":"IrfanView - lightweight graphic viewer It is designed to be simple for beginners and powerful for professionals. IrfanView seeks to create unique, new and interesting features, unlike some other graphic viewers, whose whole \"creativity\" is based on feature cloning, stealing of ideas and whole dialogs from ACDSee and/or IrfanView! (for example: XnView has been stealing/cloning features and whole dialogs from IrfanView, for 10+ years). IrfanView was the first Windows graphic viewer worldwide with Multiple (animated) GIF support. One of the first graphic viewers worldwide with Multipage TIF support. The first graphic viewer worldwide with Multiple ICO support.","tags":"Multimedia","url":"irfanview.html"},{"title":"WinMerge","text":"WinMerge is an Open Source differencing and merging tool for Windows. WinMerge can compare both folders and files, presenting differences in a visual text format that is easy to understand and handle. WinMerge is highly useful for determining what has changed between project versions, and then merging changes between versions. WinMerge can be used as an external differencing/merging tool or as a standalone application.","tags":"Others","url":"winmerge.html"},{"title":"Bluefish Editor","text":"Another cross-platform editor, Bluefish is available for Windows, Linux (various distros) and Mac. Its developers pride themselves on its lightweight design; the program is speedy and can handle dozens (or even hundreds, if you believe the documentation) of files simultaneously. Bluefish gives web developers scope for remote editing with Bluefish, and there's support for lots of programming languages (including syntax highlighting and checking). Bluefish won't be to everyone's liking, largely due to the button-strewn interface – but if you can give the UI a chance, you'll find it's a superb text editor.","tags":"Text Editors","url":"bluefish-editor.html"},{"title":"7-Zip","text":"The main features of 7-Zip High compression ratio in 7z format with LZMA and LZMA2 compression Supported formats: Packing / unpacking: 7z, XZ, BZIP2, GZIP, TAR, ZIP and WIM Unpacking only: AR, ARJ, CAB, CHM, CPIO, CramFS, DMG, EXT, FAT, GPT, HFS, IHEX, ISO, LZH, LZMA, MBR, MSI, NSIS, NTFS, QCOW2, RAR, RPM, SquashFS, UDF, UEFI, VDI, VHD, VMDK, WIM, XAR and Z. For ZIP and GZIP formats, 7-Zip provides a compression ratio that is 2-10 % better than the ratio provided by PKZip and WinZip Strong AES-256 encryption in 7z and ZIP formats Self-extracting capability for 7z format Integration with Windows Shell Powerful File Manager Powerful command line version Plugin for FAR Manager Localizations for 87 languages 7-Zip works in Windows 10 / 8 / 7 / Vista / XP / 2016 / 2012 / 2008 / 2003 / 2000 / NT.","tags":"Archivers","url":"7-zip.html"},{"title":"Blender - 3D creation suite.","text":"Blender is a professional, free and open-source 3D computer graphics software toolset used for creating animated films, visual effects, art, 3D printed models, interactive 3D applications and video games. Blender's features include 3D modeling, UV unwrapping, texturing, raster graphics editing, rigging and skinning, fluid and smoke simulation, particle simulation, soft body simulation, sculpting, animating, match moving, camera tracking, rendering, motion graphics, video editing and compositing. It also features an integrated game engine. The Blender Game Engine is a component of Blender, a free and open-source 3D production suite, used for making real-time interactive content. The game engine was written from scratch in C++ as a mostly independent component, and includes support for features such as Python scripting and OpenAL 3D sound.","tags":"Multimedia","url":"blender-3d-creation-suite.html"},{"title":"Colors - Color picker","text":"Color picker that helps you easily select a desired color using various pallets. It is also able to pick a color from the currently displayed screen content and supports a number of different color models, i.e. RGB, HSV, HLS, CMYK.","tags":"Others","url":"colors-color-picker.html"},{"title":"Cyberduck","text":"Cyberduck is a libre server and cloud storage browser for Mac and Windows with support for FTP, SFTP, WebDAV, Amazon S3, OpenStack Swift, Backblaze B2, Microsoft Azure & OneDrive, Google Drive and Dropbox. Connecting to every server. With an easy to use interface, connect to servers, enterprise file sharing and cloud storage. You can find connection profiles for popular hosting service providers.","tags":"FTP Clients","url":"cyberduck.html"},{"title":"Discord - text and voice chat for gamers","text":"The best free text and voice chat for gamers All-in-one voice and text chat for gamers that's free, secure, and works on both your desktop and phone. Stop paying for TeamSpeak servers and hassling with Skype. Simplify your life. Never pay for voice chat again Discord is always completely free to use with no gotchas. This means you can make as many servers as you want with no slot limitations. Wondering how we'll make money? In the future there will be optional cosmetics like themes, sticker packs, and sound packs available for purchase. We'll never charge for Discord's core functionality.","tags":"Chat","url":"discord-text-and-voice-chat-for-gamers.html"},{"title":"DontSleep","text":"Don't Sleep is a small portable Windows program to prevent system shutdown, Standby, Hibernate, Turn Off and Restart. Especially when old Programs run on Windows-10 or Windows 8.1 / 7. Here's more aggressive power-saving features with new rules. But not only that, it also prevents login off the computer, and the deactivation of the monitor or activation of the screen saver. Of course you can also manually disable all the options and then activate again, but with Don't Sleep one can save now many hand moves and also save time! And it's easier than ever. Apart from the fact Don't Sleep has a timer that allows time control unblock, or shutdown the computer for a specified time.","tags":"Others","url":"dontsleep.html"},{"title":"GIMP - GNU Image Manipulation Program","text":"GIMP is a freely distributed program for such tasks as photo retouching, image composition and image authoring. It has many capabilities. It can be used as a simple paint program, an expert quality photo retouching program, an online batch processing system, a mass production image renderer, an image format converter, etc. GIMP is expandable and extensible. It is designed to be augmented with plug-ins and extensions to do just about anything. The advanced scripting interface allows everything from the simplest task to the most complex image manipulation procedures to be easily scripted. GIMP is written and developed under X11 on UNIX platforms. But basically the same code also runs on MS Windows and Mac OS X.","tags":"Multimedia","url":"gimp-gnu-image-manipulation-program.html"},{"title":"Logitec Media Server - Squeezebox","text":"It doesn't matter if your library includes 100 tracks or 100,000. Or if you rip your own CDs or buy your music from services like iTunes and Amazon MP3. Download Logitech Media Server software today and start listening to your personal music collection on a Squeezebox in any room in your home. With this media server you can listen to your paid spotify account, your mp3 files, thousands of free radio stations and other online streaming services. You can also use it without the Logitec hardware by emulating the players with software like SoftSqueeze From here you can download newer beta versions of the LMS server Nightly Builds","tags":"Multimedia","url":"logitec-media-server-squeezebox.html"},{"title":"qBittorrent","text":"Lightweight Torrent Client qBittorrent is a fast, lightweight bittorrent client with a familiar interface. Features Polished familiar user interface Integrated search engine (adding new sites is not currently supported) All Bittorrent extensions: DHT, Peer Exchange, Full encryption, Magnet/BitComet URIs, etc Remote control through a Web user interface Advanced control over trackers, peers and torrents (queueing and prioritizing) UPnP / NAT-PMP port forwarding support Available in ~25 languages (Unicode support) Torrent creation tool Advanced RSS support with download filters (inc. regex) Bandwidth scheduler IP Filtering (eMule and PeerGuardian compatible) IPv6 compliant","tags":"Network","url":"qbittorrent.html"},{"title":"ReNamer","text":"ReNamer is a very powerful and flexible file renaming tool, which offers all the standard renaming procedures, including prefixes, suffixes, replacements, case changes, as well as removing contents of brackets, adding number sequences, changing file extensions, etc. For advanced users there is support for Regular Expressions and a PascalScript rule, which lets users program their very own renaming rule. Program allows you to combine multiple renaming actions as a rule set, applying each action in a logical sequence, which can be saved, loaded, and managed within the program. In addition, it has an ability to rename folders, process regular expressions, Unicode capable, and supports variety of meta tags, such as: ID3v1, ID3v2, EXIF, OLE, AVI, MD5, CRC32, and SHA1. This app can convert Bulgarian/Cyrillic and many other languages to Latin file names.","tags":"Others","url":"renamer.html"},{"title":"TeamViewer","text":"Empowering secure remote desktop access and support TeamViewer connects people, places and things around the world on the widest array of platforms and technologies. Its paid for commercial use but free for personal use and is one of the best remote desktop tools I have used. Don't forget to enable 2-fact. authentication as they were recently hacked.","tags":"Network","url":"teamviewer.html"},{"title":"Viber","text":"Viber is a light weight cross platform instant messenging and voice over ip client. It uses your phone number as a client ID so it requires a telephone computer to operate and offers very good voice compression that makes it perfect for slow 3g connections.","tags":"Chat","url":"viber.html"},{"title":"Foscam IP Camera Tool","text":"H.264 Camera Client The client can monitor 16 cameras at one page; Supports previous record; Supports Preset, you can set 256 presets; Supports PTZ; Supports multi-device record at the same time; Supports five alarm types: Motion Detection, Input Alarm, Lost Connect, Hard Disk Full, Hard Disk Error The Linkage Alarm has four types: Popup View Window, Electron Map Alarm, Linkage Record and Sound Alarm Multi-level users management with password protection I can't configure my FI9826W Foscam camera without this software.","tags":"IP Cams","url":"foscam-ip-camera-tool.html"},{"title":"Airytec Switch Off","text":"Switch Off is a lightweight easy-to-use tray-based system utility that could automatically shutdown, suspend or hibernate your system. This could cut your electricity bills and save the Environment by lowering your PC power consumption. It could also disconnect dial-up and VPN connections to cut your internet service bills as well. Build-in operation set could be easily extended by adding your own scripts. Automation options allows you to schedule all operations daily, weekly, past specified time or when PC becomes idle. Utility has user-friendly intuitive interface designed to seamlessly integrate into your Vista, Windows 7 or 10 system and to provide quick access to all operations through the system tray icon. Simple password protected Web interface allows you to initiate operations remotely from any computer or mobile (cell) phone with web browser installed. Utility features small system and resource requirements, needs no additional frameworks or libraries to operate, works when either user is logged on or not, available as full and portable versions.","tags":"Others","url":"airytec-switch-off.html"},{"title":"Calibre","text":"Calibre is a powerful and easy to use e-book manager. Users say it's outstanding and a must-have. It'll allow you to do nearly everything and it takes things a step beyond normal e-book software. It's also completely free and open source and great for both casual users and computer experts. Save time on managing your e-book collection Use it everywhere and with anything Comprehensive e-book viewer Download news/magazines from the web Share and backup your library easily Edit the books in your collection Satisfy every e-book need and get support","tags":"Multimedia","url":"calibre.html"},{"title":"Cmdow","text":"Win32 console application for manipulating program windows. Cmdow is a Win32 commandline utility for NT4/2000/XP/2003/2008/7 that allows windows to be listed, moved, resized, renamed, hidden/unhidden, disabled/enabled, minimized, maximized, restored, activated/inactivated, closed, killed and more. It is a small standalone executable. It does not create any temporary files, nor does it write to the registry. There is no installation procedure, just run it. To completely remove all traces of it from your system, delete it. Cmdow was written with batch file programmers in mind. Particular attention has been paid to Cmdows output making it easy to process with the 'FOR /F' command found in the Windows command processor (cmd.exe).","tags":"Others","url":"cmdow.html"},{"title":"CPU-Z","text":"CPU-Z is a freeware that gathers information on some of the main devices of your system : Processor name and number, codename, process, package, cache levels. Mainboard and chipset. Memory type, size, timings, and module specifications (SPD). Real time measurement of each core's internal frequency, memory frequency.","tags":"Sys info","url":"cpu-z.html"},{"title":"Etcher","text":"Burn. Better. Burn images to SD cards & USB drives, safely and easily. Features: Validated Burning - No more writing images on corrupted cards and wondering why your device isn't booting. Hard Drive Friendly - Makes drive selection obvious to avoid wiping your entire hard-drive Beautiful Interface - Who said burning SD cards has to be an eyesore. Open Source - Made with JS, HTML, node.js and Electron. Dive in and contribute! Cross Platform - Works for everyone, no more complicated install instructions.","tags":"SD Cards","url":"etcher.html"},{"title":"Everything","text":"Locate files and folders by name instantly. \"Everything\" is search engine that locates files and folders by filename instantly for Windows. Unlike Windows search \"Everything\" initially displays every file and folder on your computer (hence the name \"Everything\"). You type in a search filter to limit what files and folders are displayed.","tags":"Others","url":"everything.html"},{"title":"FAT32 Format","text":"Format parttions bigger than 32 GB with FAT32","tags":"SD Cards","url":"fat32-format.html"},{"title":"FileZilla","text":"FileZilla - The free FTP solution for both client and server. Filezilla is open source software distributed free of charge. Features Among others, the features of FileZilla include the following: Easy to use Supports FTP, FTP over SSL/TLS (FTPS) and SSH File Transfer Protocol (SFTP) Cross-platform. Runs on Windows, Linux, *BSD, Mac OS X and more IPv6 support Available in many languages Supports resume and transfer of large files >4GB Tabbed user interface Powerful Site Manager and transfer queue Bookmarks Drag & drop support Configurable transfer speed limits Filename filters Directory comparison Network configuration wizard Remote file editing Keep-alive HTTP/1.1, SOCKS5 and FTP-Proxy support Logging to file Synchronized directory browsing Remote file search","tags":"FTP Clients","url":"filezilla.html"},{"title":"iSpy: Open Source Camera Security Software","text":"iSpy the most feature-rich surveillance software in the world!. Some key features include: Unlimited Cameras and Microphones (including IP and USB cameras), Motion Detection, Motion Processing, Recording, Scheduling, Audio, Remote Access, Network Audio Broadcasting, Password Protection, Desktop Recording, YouTube Uploading, Cloud Uploading, FTP, SFTP, SMS, Twitter and Email alerts. Feature List Embed the iSpy Viewer in your own website Control PTZ enabled IP cameras Talk function to Foscam, Axis iSpyServer and IP Webcam Android cameras Text to speech - talk through the website via text to speech or dictation Listen to and monitor remote microphones live over the network Pair video and audio sources for capturing movies with sound Upload to YouTube, Dropbox and Google Drive Command line access (integrate with home automation) Remote Commands (execute over the web or via mobile devices) Desktop capturing Mobile device access Unlimited cameras Detect, highlight, track and record movement Record video and audio on demand (and via the web) Customize movement detection areas on your cameras FTP and SFTP frames from your camera to a remote server Capture Snapshots and Timelapse Email, SMS and Twitter alerts Access and control iSpy remotely via iSpyConnect Full scheduling support PTZ Object tracking Plug-ins for ALPR, Face Detection and more","tags":"IP Cams","url":"ispy-open-source-camera-security-software.html"},{"title":"Kitty","text":"KiTTY is a fork of PuTTY, that is portable and can save connection passwords. Additional features over PuTTy Sessions filter Shortcuts for pre-defined command The session launcher Automatic logon script URL hyperlinks Running a locally saved script on a remote session Send to tray Transparency Quick start of a duplicate session SSH Handler: Internet Explorer integration pscp.exe and WinSCP integration New command-line options","tags":"SSH Clients","url":"kitty.html"},{"title":"MiniTool Partition Wizard Free Edition","text":"Partition management Free partition manager can totally meet Windows PC users' demands for partition management. Extend partition: increase partition capacity without damaging data. Interconvert file system perfectly between FAT and NTFS. Set partition label: users can add annotation for partition according to actual needs. Help users check the completeness of file system at any time. Once problem emerges, it can help fix it. Perfectly support mobile devices, like U disk and SD card. Copy wizard Help users complete disk copy and partition copy: Copy partition as well as data stored on the partition quickly so as to protect data. Copy the whole disk to non-system disk so as to avoid reinstalling operating system. Partition recovery Help users recover lost partition quickly: Recover partition which is lost due to personal mistake, software error, virus attack, and other factors. Support recovering partitions with different kinds of file systems like FAT and NTFS.","tags":"Others","url":"minitool-partition-wizard-free-edition.html"},{"title":"Notepad ++","text":"Features Syntax Highlighting and Syntax Folding User Defined Syntax Highlighting and Folding: screenshot 1, screenshot 2, screenshot 3 and screenshot 4 PCRE (Perl Compatible Regular Expression) Search/Replace GUI entirely customizable: minimalist, tab with close button, multi-line tab, vertical tab and vertical document list Document Map Auto-completion: Word completion, Function completion and Function parameters hint Multi-Document (Tab interface) Multi-View WYSIWYG (Printing) Zoom in and zoom out Multi-Language environment supported Bookmark Macro recording and playback Launch with different arguments","tags":"Text Editors","url":"notepad.html"},{"title":"NSSM - the Non-Sucking Service Manager","text":"nssm is a service helper which doesn't suck. srvany and other service helper programs suck because they don't handle failure of the application running as a service. If you use such a program you may see a service listed as started when in fact the application has died. nssm monitors the running service and will restart it if it dies. With nssm you know that if a service says it's running, it really is. Alternatively, if your application is well-behaved you can configure nssm to absolve all responsibility for restarting it and let Windows take care of recovery actions. nssm logs its progress to the system Event Log so you can get some idea of why an application isn't behaving as it should. nssm also features a graphical service installation and removal facility. Prior to version 2.19 it did suck. Now it's quite a bit better.","tags":"Others","url":"nssm-the-non-sucking-service-manager.html"},{"title":"Open Hardware Monitor","text":"The Open Hardware Monitor is a free open source software that monitors temperature sensors, fan speeds, voltages, load and clock speeds of a computer. The Open Hardware Monitor supports most hardware monitoring chips found on todays mainboards. The CPU temperature can be monitored by reading the core temperature sensors of Intel and AMD processors. The sensors of ATI and Nvidia video cards as well as SMART hard drive temperature can be displayed. The monitored values can be displayed in the main window, in a customizable desktop gadget, or in the system tray. The free Open Hardware Monitor software runs on 32-bit and 64-bit Microsoft Windows XP / Vista / 7 / 8 / 8.1 / 10 and any x86 based Linux operating systems without installation. Open Hardware Monitor have a web interface that can be used for remote monitoring.","tags":"Sys info","url":"open-hardware-monitor.html"},{"title":"PuTTY","text":"PuTTY is an SSH and telnet client, developed originally by Simon Tatham for the Windows platform. PuTTY is open source software that is available with source code and is developed and supported by a group of volunteers.","tags":"SSH Clients","url":"putty.html"},{"title":"Rufus","text":"Create bootable USB drives the easy way Rufus is a utility that helps format and create bootable USB flash drives, such as USB keys/pendrives, memory sticks, etc. It can be especially useful for cases where: you need to create USB installation media from bootable ISOs (Windows, Linux, UEFI, etc.) you need to work on a system that doesn't have an OS installed you need to flash a BIOS or other firmware from DOS you want to run a low-level utility Despite its small size, Rufus provides everything you need! Oh, and Rufus is fast. For instance it's about twice as fast as UNetbootin, Universal USB Installer or Windows 7 USB download tool, on the creation of a Windows 7 USB installation drive from an ISO. It is also marginally faster on the creation of Linux bootable USB from ISOs. (1)","tags":"SD Cards","url":"rufus.html"},{"title":"SD Memory Card Formatter","text":"The SD Memory Card Formatter formats SD Memory Card, SDHC Memory Card and SDXC Memory Card (respectively SD/SDHC/SDXC Cards) complying with the SD File System Specification created by the SD Association (SDA). It is strongly recommended to use the SD Memory Card Formatter to format SD/SDHC/SDXC Cards rather than using formatting tools provided with individual operating systems. In general, formatting tools provided with operating systems can format various storage media including SD/SDHC/SDXC Cards, but it may not be optimized for SD/SDHC/SDXC Cards and it may result in lower performance. SD/SDHC/SDXC Cards have a \"Protected Area\" for SD Card security purposes. The SD Memory Card Formatter does not format the protected area in the SD/SDHC/SDXC Cards. The protected area shall be formatted by an appropriate PC application or SD host devices that provide SD security function. The SD Memory Card Formatter doesn't support SD/SDHC/SDXC Card encrypted by the \"BitLocker To Go\" functionality of Windows. Please format the SD/SDHC/SDXC Card after it has been unlocked.","tags":"SD Cards","url":"sd-memory-card-formatter.html"},{"title":"VirtualDub","text":"VirtualDub is a video capture/processing utility for 32-bit and 64-bit Windows platforms (98/ME/NT4/2000/XP/Vista/7), licensed under the GNU General Public License (GPL). It lacks the editing power of a general-purpose editor such as Adobe Premiere, but is streamlined for fast linear operations over video. It has batch-processing capabilities for processing large numbers of files and can be extended with third-party video filters. VirtualDub is mainly geared toward processing AVI files, although it can read (not write) MPEG-1 and also handle sets of BMP images. This one is great for creating quick timelapses without many editing. You can quickly crop, resize and apply some other filters to your photos. Then you have to set frame rate and video codec and you are good to go.","tags":"Multimedia","url":"virtualdub.html"},{"title":"Win32 Disk Imager","text":"This program is designed to write a raw disk image to a removable device or backup a removable device to a raw image file. It is very useful for embedded development, namely Arm development projects (Android, Ubuntu on Arm, etc). Anyone is free to branch and modify this program. Patches are always welcome.","tags":"SD Cards","url":"win32-disk-imager.html"},{"title":"WinSCP","text":"WinSCP is an open source free SFTP client, FTP client, WebDAV client, S3 client and SCP client for Windows. Its main function is file transfer between a local and a remote computer. Beyond this, WinSCP offers scripting and basic file manager functionality. Features Graphical user interface (screenshots) Translated into many languages Integration with Windows (drag&drop, URL, shortcut icons, jump list) All common operations with files Support for SFTP and SCP protocols over SSH and FTP and WebDAV and S3 protocols Batch file scripting and command-line interface and .NET assembly for advanced programming tasks Directory synchronization in several semi or fully automatic ways Integrated text editor Shares site settings with PuTTY Support for password, keyboard-interactive, public key and Kerberos (GSS) authentication Integrates with Pageant (PuTTY authentication agent) for full support of public key authentication with SSH Explorer and Commander interfaces Optionally protects stored site information with master password Optionally supports portable operation using a configuration file in place of registry entries, suitable for operation from removable media","tags":"FTP Clients","url":"winscp.html"},{"title":"Yawcam - Yet Another WebCAM Software","text":"Turn your web-camera into IP-camera Yawcam is short for Yet Another WebCAM software. More precise Yawcam is a webcam software for Windows written in Java. The main ideas for Yawcam are to keep it simple and easy to use but to include all the usual features. Features Video streaming Image snapshots Built-in webserver Motion detection Ftp-upload Text and image overlays Password protection Online announcements for communities Scheduler for online time Time lapse movies Run as a Windows service Multi languages Very lightweight and stable software, I am using it for years and had no issues with it.","tags":"IP Cams","url":"yawcam-yet-another-webcam-software.html"}]}